/*
 * @description 数字分割符
 */

// 允许数字之间使用间隔符号来表示数字使得数字更易理解

let num = 1_000_000;
console.log(num); // 1000000

// 分割符号是可选位置得;
num = 1_0_0_0_0_0;
console.log(num); // 100000

// 同样适用于2进制, 8进制，16进制,和BigInt

// 2进制数据 2进制以0b或者0B开头
num = 0b1111; // 15 (8+4+2+1)
num = 0b1_1_1_1; // 15
num = 0b11_11; // 15
// 注意不能在前缀处分割 例0_b_1111 0B_1111 这样是不支持。

// 8进制 0o开头
num = 0o11; // 9 (8 +1)
num = 0o1_1; // 9
// 注意不能在前缀处分割 例0_o_11 0o_1111 这样是不支持。

// 16进制 0x或者0X开头
num = 0x11; // 17 (16+1)
num = 0x1_1; // 17 (16+1)

// BigInt 表示一个超过NUM.maxValue的值
// 见文件夹 2020/BigInt
num = 1111111n;
num = 1_1_11111n;
